; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
;; vehicles=4, packages=5, locations=9, density=0.5, fully_connected=False, max_capacity=2, out_folder=./dense/training, instance_id=32, seed=73

(define (problem transport-32)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 - vehicle
    p1 p2 p3 p4 p5 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c2)
    (capacity v2 c1)
    (capacity v3 c2)
    (capacity v4 c1)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l8)
    (at p2 l5)
    (at p3 l2)
    (at p4 l8)
    (at p5 l7)
    (at v1 l9)
    (at v2 l9)
    (at v3 l4)
    (at v4 l8)
    (road l3 l8)
    (road l6 l2)
    (road l6 l5)
    (road l5 l8)
    (road l4 l9)
    (road l8 l1)
    (road l1 l8)
    (road l5 l7)
    (road l7 l9)
    (road l8 l3)
    (road l2 l6)
    (road l5 l6)
    (road l7 l5)
    (road l9 l7)
    (road l8 l5)
    (road l9 l4)
    (road l6 l8)
    (road l8 l6)
    (road l4 l8)
    (road l8 l4)
    (road l4 l7)
    (road l7 l4)
    (road l4 l6)
    (road l6 l4)
    (road l2 l7)
    (road l7 l2)
    (road l1 l7)
    (road l7 l1)
    (road l3 l4)
    (road l4 l3)
    (road l1 l3)
    (road l3 l1)
    (road l3 l9)
    (road l9 l3)
    (road l8 l9)
    (road l9 l8)
    )
 (:goal  (and 
    (at p1 l9)
    (at p2 l4)
    (at p3 l6)
    (at p4 l5)
    (at p5 l4))))

; plan
1. (drive v3 l4 l8)
   deleted: (at v3 l4)
   added: (at v3 l8)
   goals met: 0 of 5
2. (pick-up v3 l8 p4 c1 c2)
   deleted: (at p4 l8) (capacity v3 c2)
   added: (in p4 v3) (capacity v3 c1)
   goals met: 0 of 5
3. (drive v3 l8 l5)
   deleted: (at v3 l8)
   added: (at v3 l5)
   goals met: 0 of 5
4. (pick-up v3 l5 p2 c0 c1)
   deleted: (at p2 l5) (capacity v3 c1)
   added: (in p2 v3) (capacity v3 c0)
   goals met: 0 of 5
5. (drop v3 l5 p4 c0 c1)
   deleted: (in p4 v3) (capacity v3 c0)
   added: (at p4 l5) (capacity v3 c1)
   goals met: 1 of 5
6. (drive v3 l5 l7)
   deleted: (at v3 l5)
   added: (at v3 l7)
   goals met: 1 of 5
7. (pick-up v3 l7 p5 c0 c1)
   deleted: (at p5 l7) (capacity v3 c1)
   added: (in p5 v3) (capacity v3 c0)
   goals met: 1 of 5
8. (drive v3 l7 l4)
   deleted: (at v3 l7)
   added: (at v3 l4)
   goals met: 1 of 5
9. (drop v3 l4 p2 c0 c1)
   deleted: (in p2 v3) (capacity v3 c0)
   added: (at p2 l4) (capacity v3 c1)
   goals met: 2 of 5
10. (drop v3 l4 p5 c1 c2)
   deleted: (in p5 v3) (capacity v3 c1)
   added: (at p5 l4) (capacity v3 c2)
   goals met: 3 of 5
11. (pick-up v4 l8 p1 c0 c1)
   deleted: (at p1 l8) (capacity v4 c1)
   added: (in p1 v4) (capacity v4 c0)
   goals met: 3 of 5
12. (drive v4 l8 l9)
   deleted: (at v4 l8)
   added: (at v4 l9)
   goals met: 3 of 5
13. (drop v4 l9 p1 c0 c1)
   deleted: (in p1 v4) (capacity v4 c0)
   added: (at p1 l9) (capacity v4 c1)
   goals met: 4 of 5
14. (drive v4 l9 l7)
   deleted: (at v4 l9)
   added: (at v4 l7)
   goals met: 4 of 5
15. (drive v4 l7 l2)
   deleted: (at v4 l7)
   added: (at v4 l2)
   goals met: 4 of 5
16. (pick-up v4 l2 p3 c0 c1)
   deleted: (at p3 l2) (capacity v4 c1)
   added: (in p3 v4) (capacity v4 c0)
   goals met: 4 of 5
17. (drive v4 l2 l6)
   deleted: (at v4 l2)
   added: (at v4 l6)
   goals met: 4 of 5
18. (drop v4 l6 p3 c0 c1)
   deleted: (in p3 v4) (capacity v4 c0)
   added: (at p3 l6) (capacity v4 c1)
   goals met: 5 of 5
